In [ ]:
# from mini_project2 import (
#     step1_create_region_table,
#     step2_create_region_to_regionid_dictionary,
#     step3_create_country_table,
#     step4_create_country_to_countryid_dictionary,
#     step5_create_customer_table,
#     step6_create_customer_to_customerid_dictionary,
#     step7_create_productcategory_table,
#     step8_create_productcategory_to_productcategoryid_dictionary,
#     step9_create_product_table,
#     step10_create_product_to_productid_dictionary,
#     step11_create_orderdetail_table
# )
# from sqlalchemy import create_engine
# import pandas as pd

# # # Replace with your Render DB URL
# # db_url = "postgresql://devraj:lbXWHzQhcCl7X3sGVrzZ25Y7Bz9Y2l2J@dpg-d4n94cs9c44c738lb2g0-a.oregon-postgres.render.com/eas503"
# # engine = create_engine(db_url)

# # # Test query
# # df = pd.read_sql("SELECT * FROM Country LIMIT 5;", engine)
# # df.head()




data_file = "tests/data.csv"          
db_file = "normalized.db"


# step1_create_region_table(data_file, db_file)
# step2_create_region_to_regionid_dictionary(db_file)

# step3_create_country_table(data_file, db_file)
# step4_create_country_to_countryid_dictionary(db_file)

# step5_create_customer_table(data_file, db_file)
# step6_create_customer_to_customerid_dictionary(db_file)

# step7_create_productcategory_table(data_file, db_file)
# step8_create_productcategory_to_productcategoryid_dictionary(db_file)

# step9_create_product_table(data_file, db_file)

# step10_create_product_to_productid_dictionary(db_file)
# step11_create_orderdetail_table(data_file, db_file)

RENDER_DB_HOST = "dpg-d4n94cs9c44c738lb2g0-a.oregon-postgres.render.com"
RENDER_DB_PORT = "5432"
RENDER_DB_NAME = "eas503"
RENDER_DB_USER = "devraj"
RENDER_DB_PASS = "lbXWHzQhcCl7X3sGVrzZ25Y7Bz9Y2l2J" 

print("Credentials set locally for the notebook session.")

import pandas as pd
from mini_project2 import create_connection, ex1, ex2, ex3, ex4, ex5, ex6, ex7, ex8, ex9, ex10, ex11
import psycopg2
from psycopg2 import Error

def create_pg_connection():
    """Establishes a connection to the Render PostgreSQL database."""
    conn = None
    try:
        conn = psycopg2.connect(
            dbname=RENDER_DB_NAME,
            user=RENDER_DB_USER,
            password=RENDER_DB_PASS,
            host=RENDER_DB_HOST,
            port=RENDER_DB_PORT
        )

        print("Connection to Render successful.")
        return conn

    except Error as e:
        print(f"PostgreSQL Connection Error: {e}")
        return None


def create_table(conn, create_table_sql, drop_table_name=None):
    """Creates a table, optionally dropping the old one."""
    if conn is None:
        print("Connection is None, skipping table creation.")
        return

    try:
        cursor = conn.cursor()
        if drop_table_name:
            
            cursor.execute(f'DROP TABLE IF EXISTS "{drop_table_name}" CASCADE;')
            print(f"Dropped table: {drop_table_name}")
        
        cursor.execute(create_table_sql)
        conn.commit() 
        print(f"Table created/updated.")
        
    except Error as e:
        print(f"Error executing SQL for table creation: {e}")
        conn.rollback()
    finally:
        cursor.close()
conn = create_pg_connection()
conn
cursor = conn.cursor()
cursor.execute("SELECT NOW();")
result = cursor.fetchall()
cursor.close()

result
DB_PATH = r"/Users/devrajtikam/Downloads/mini-projecthash2/normalized.db"

conn = create_connection(DB_PATH)
conn
tables = pd.read_sql_query(
    "SELECT name FROM sqlite_master WHERE type='table' ORDER BY NAME",
    conn
)
tables
print(tables.head())
sql = ex4(conn)
print(sql)

df = pd.read_sql_query(sql, conn)
df.head()

Credentials set locally for the notebook session.
Connection to Render successful.
              name
0          Country
1         Customer
2      OrderDetail
3          Product
4  ProductCategory

    SELECT Region.Region AS Region,
    ROUND(SUM(Product.ProductUnitPrice*OrderDetail.QuantityOrdered),2) AS Total
    FROM OrderDetail
    JOIN Customer ON OrderDetail.CustomerID=Customer.CustomerID
    JOIN Product ON OrderDetail.ProductID=Product.ProductID
    JOIN Country ON Customer.CountryID=Country.CountryID
    JOIN Region ON Country.RegionID=Region.RegionID
    GROUP BY Region.Region
    ORDER BY Total DESC;

            Region         Total
0   Western Europe  1.399034e+08
1    South America  8.367663e+07
2    North America  8.019435e+07
3  Southern Europe  4.879062e+07
4    British Isles  3.899529e+07

In [16]:
import sqlite3
import pandas as pd
from mini_project2 import ex1,ex2,ex3,ex4,ex5,ex6,ex7,ex8,ex9,ex10,ex11  
conn = sqlite3.connect(db_file)

In [17]:
from mini_project2 import step6_create_customer_to_customerid_dictionary

cdict = step6_create_customer_to_customerid_dictionary(db_file)
print(list(cdict.keys())[:10])  # show first 10 customer names

['Alejandra Camino', 'Alexander Feuer', 'Ana Trujillo', 'Anabela Domingues', 'Andre Fonseca', 'Ann Devon', 'Annette Roulet', 'Antonio Moreno', 'Aria Cruz', 'Art Braunschweiger']

In [18]:
#ex1
customer_name = "Aria Cruz"  
sql = ex1(conn, customer_name)
df = pd.read_sql_query(sql, conn)
print(f"Orders for customer: {customer_name}")
print(df.head())

Orders for customer: Aria Cruz
        Name             ProductName   OrderDate  ProductUnitPrice  \
0  Aria Cruz  NuNuCa Nu-Nougat-Creme  2012-11-06             14.00
1  Aria Cruz        Chartreuse verte  2012-11-06             18.00
2  Aria Cruz        Boston Crab Meat  2012-11-06             18.40
3  Aria Cruz    Rhonbrau Klosterbier  2012-11-06              7.75
4  Aria Cruz      Guarana Fantastica  2012-12-18              4.50

   QuantityOrdered  Total
0               10  140.0
1               50  900.0
2                4   73.6
3                6   46.5
4               15   67.5

In [19]:
#ex2
sql = ex2(conn, customer_name)
df = pd.read_sql_query(sql, conn)
print(f"Total spending for customer: {customer_name}")
print(df)

Total spending for customer: Aria Cruz
        Name      Total
0  Aria Cruz  5177235.8

In [20]:
#ex3
df = pd.read_sql_query(ex3(conn), conn)
print("Total spending for all customers (descending):")
print(df.head(10))  # show top 10

Total spending for all customers (descending):
                 Name       Total
0      Annette Roulet  6092806.79
1      Manuel Pereira  5905784.45
2      Janete Limeira  5817785.32
3  Christina Berglund  5679042.68
4           Liz Nixon  5623333.51
5          John Steel  5585858.39
6        Paul Henriot  5584530.02
7       Rene Phillips  5565819.72
8   Anabela Domingues  5539991.05
9       Martine Rance  5421252.67

In [21]:
#ex4
df = pd.read_sql_query(ex4(conn), conn)
print("Total spending by region:")
print(df)

Total spending by region:
            Region         Total
0   Western Europe  1.399034e+08
1    South America  8.367663e+07
2    North America  8.019435e+07
3  Southern Europe  4.879062e+07
4    British Isles  3.899529e+07
5  Central America  2.514686e+07
6  Northern Europe  2.109077e+07
7      Scandinavia  1.500917e+07
8   Eastern Europe  5.196640e+06

In [22]:
#ex5
df = pd.read_sql_query(ex5(conn), conn)
print("Total spending by country:")
print(df)

Total spending by country:
        Country       Total
0           USA  65090437.0
1       Germany  55556848.0
2        France  54388487.0
3        Brazil  47467769.0
4            UK  34560755.0
5        Mexico  25146864.0
6         Spain  23968999.0
7     Venezuela  21404996.0
8        Canada  15103910.0
9     Argentina  14803867.0
10        Italy  14437243.0
11      Denmark  10611365.0
12       Sweden  10479408.0
13     Portugal  10384379.0
14      Finland  10361235.0
15  Switzerland  10324316.0
16      Austria   9961995.0
17      Belgium   9671730.0
18       Poland   5196640.0
19       Norway   4647933.0
20      Ireland   4434538.0

In [23]:
#ex6
df = pd.read_sql_query(ex6(conn), conn)
print("Country ranking within each region:")
print(df)

Country ranking within each region:
             Region      Country  CountryTotal  TotalRank
0     British Isles           UK    34560755.0          1
1     British Isles      Ireland     4434538.0          2
2   Central America       Mexico    25146864.0          1
3    Eastern Europe       Poland     5196640.0          1
4     North America          USA    65090437.0          1
5     North America       Canada    15103910.0          2
6   Northern Europe      Denmark    10611365.0          1
7   Northern Europe       Sweden    10479408.0          2
8       Scandinavia      Finland    10361235.0          1
9       Scandinavia       Norway     4647933.0          2
10    South America       Brazil    47467769.0          1
11    South America    Venezuela    21404996.0          2
12    South America    Argentina    14803867.0          3
13  Southern Europe        Spain    23968999.0          1
14  Southern Europe        Italy    14437243.0          2
15  Southern Europe     Portugal    10384379.0          3
16   Western Europe      Germany    55556848.0          1
17   Western Europe       France    54388487.0          2
18   Western Europe  Switzerland    10324316.0          3
19   Western Europe      Austria     9961995.0          4
20   Western Europe      Belgium     9671730.0          5

In [24]:
#ex7
df = pd.read_sql_query(ex7(conn), conn)
print("Top country in each region:")
print(df)

Top country in each region:
            Region  Country  CountryTotal  CountryRegionalRank
0    British Isles       UK    34560755.0                    1
1  Central America   Mexico    25146864.0                    1
2   Eastern Europe   Poland     5196640.0                    1
3    North America      USA    65090437.0                    1
4  Northern Europe  Denmark    10611365.0                    1
5      Scandinavia  Finland    10361235.0                    1
6    South America   Brazil    47467769.0                    1
7  Southern Europe    Spain    23968999.0                    1
8   Western Europe  Germany    55556848.0                    1

In [25]:
#ex8
df = pd.read_sql_query(ex8(conn), conn)
print("Customer sales by quarter and year:")
print(df.head(10))  # first 10 rows

Customer sales by quarter and year:
  Quarter  Year  CustomerID     Total
0      Q3  2012           1  222850.0
1      Q3  2012           2  284898.0
2      Q3  2012           3  415084.0
3      Q3  2012           4  389739.0
4      Q3  2012           5  374269.0
5      Q3  2012           6  242760.0
6      Q3  2012           7  280481.0
7      Q3  2012           8  502864.0
8      Q3  2012           9  176773.0
9      Q3  2012          10  191473.0

In [26]:
#ex9
df = pd.read_sql_query(ex9(conn), conn)
print("Top 5 customers per quarter and year:")
print(df.head(10))  # first 10 rows

Top 5 customers per quarter and year:
  Quarter  Year  CustomerID     Total  CustomerRank
0      Q3  2012          79  561433.0             1
1      Q3  2012          29  536849.0             2
2      Q3  2012           8  502864.0             3
3      Q3  2012          30  500478.0             4
4      Q3  2012          71  483266.0             5
5      Q4  2012          59  768918.0             1
6      Q4  2012          30  763160.0             2
7      Q4  2012          78  734280.0             3
8      Q4  2012          25  699529.0             4
9      Q4  2012          34  657938.0             5

In [27]:
#ex10
df = pd.read_sql_query(ex10(conn), conn)
print("Monthly sales ranking:")
print(df)

Monthly sales ranking:
        Month       Total  TotalRank
0    December  43732051.0          1
1     January  43703357.0          2
2    November  42470455.0          3
3      August  42089291.0          4
4     October  41825617.0          5
5   September  41262999.0          6
6        July  39418066.0          7
7    February  35726463.0          8
8         May  33540399.0          9
9       April  32111378.0         10
10       June  31646481.0         11
11      March  30509888.0         12

In [28]:
#ex11
df = pd.read_sql_query(ex11(conn), conn)
print("Max days without order per customer:")
print(df.head(10))

Max days without order per customer:
   CustomerID   FirstName   LastName    Country   OrderDate PreviousOrderDate  \
0          70    Patricio    Simpson  Argentina  2015-03-20        2015-01-01
1          26  Frederique    Citeaux     France  2014-05-02        2014-02-23
2          54      Manuel    Pereira  Venezuela  2015-04-24        2015-02-18
3           8     Antonio     Moreno     Mexico  2015-06-16        2015-04-14
4          23      Felipe  Izquierdo  Venezuela  2014-12-16        2014-10-16
5          49    Laurence    Lebihan     France  2013-09-10        2013-07-14
6          30       Hanna       Moos    Germany  2013-10-18        2013-08-21
7          67       Paolo    Accorti      Italy  2014-07-22        2014-05-26
8          74       Pedro     Afonso     Brazil  2012-10-30        2012-09-04
9          33   Helvetius       Nagy        USA  2013-02-14        2012-12-20

   MaxDaysWithoutOrder
0                 78.0
1                 68.0
2                 65.0
3                 63.0
4                 61.0
5                 58.0
6                 58.0
7                 57.0
8                 56.0
9                 56.0

In [29]:
df = pd.read_sql_query("SELECT * FROM OrderDetail LIMIT 10;", conn)
df

   OrderID  CustomerID  ProductID   OrderDate  QuantityOrdered
0        1           1         68  2012-08-14                1
1        2           1         22  2012-08-14                6
2        3           1         66  2012-08-14                4
3        4           1         42  2012-08-15                6
4        5           1         53  2012-08-15                2
5        6           1         42  2012-09-16               10
6        7           1         49  2012-09-16               10
7        8           1         71  2012-09-16                5
8        9           1         42  2014-03-02                1
9       10           1          4  2014-03-02               10